package cn.lee.bookstore.bean;

import java.util.List;

/**
 * Created by Administrator on 2016/1/9.
 */
public class BookDetail {

    /**
     * resultcode : 200
     * reason : Success
     * result : {"data":[{"title":"悲惨世界","catalog":"外国文学 小说 经典名著 ","tags":"","sub1":"关于苦难的世界名著《悲惨世界》","sub2":"《悲惨世界》是法国著名作家雨果的经典名著，作为人类思想产生的一部伟大作品、文学巨著的一个丰碑，在世界文学宝库中占有无可争议的不朽地位。被评为世界十大名著，影响世界的100本书。\n&nbsp;\n名著之所以成为名著，在深度和广度上要有突出的表现。在广度上，描述了拿破仑战争期间和之后十几年的社会万象，融进了法国的历史、革命、战争、道德哲学、法律、正义、宗教信仰，作者对小说主要人物的原型、场景、社会现象进行了大量资料的收集和实地考察，雨果讲述每一个社会局部，都有着新闻记者似的准确，田野调查般的详实，作品几乎是一部拿破仑时代关于巴黎的百科全书。从构思到成书，历时30年，作者命运起起伏伏，社会也发生巨大改变，既为作者积累丰富的材料，也让作者目光变得更加深邃。在深度上，作者对人类苦难和人性有着触达灵魂的思考，《悲惨世界》被誉为人类苦难的百科全书。在人性的思考上，中国的文学和影视作品和欧美相差甚远，希望国人可以多读世界名著。\n&nbsp;\n金庸大师的《神雕侠侣》中，郭靖对杨过说，善与恶，都在一念之间。一念之差，杨康成了人人唾弃的卖国贼；一念之上，杨过成了神雕大侠。很多作品中，坏人总是极坏的，从里到外都是坏的；好人总是极好的，常因为好的过头而吃了坏人的大亏，让读者虐心。我们从小就被教育为非黑即白，事实上世界不是黑的也不是白的，而是灰的。没有人生下来就是坏人，一个人作恶，很多时候，社会负有很大的责任。《悲惨世界》主角冉阿让本是一个贫困的市民，老实本分的养家糊口，具有劳动人民吃苦耐劳的优良品质。直到社会让他失了业，和姐姐一家饿了肚子几天，为了救活7个外甥，跑到面包店偷了一个面包，被判入狱5年。出于对司法的不信任，冉阿让多次越狱被抓回，前后一共在牢中做苦役19年。19年的牢狱生活没有让冉阿让往好的一面改变，反而变得仇恨一切，不相信任何人，变成一个孤独而凶狠的男人。\n&nbsp;\n出狱后，冉阿让因为一张带有犯罪记录标识的身份证，被社会视作危险人物，天下之大，没有容身之地。\u201c我又走到另外一家客店。他们对我说：\u2018滚！\u2019这家不要我。那家也不要我。我又到了监狱，看门的人也不肯开门。我也到过狗窝。那狗咬了我，也把我撵了出来，好象它也是人似的，好象它也知道我是谁似的。我就跑到田里，打算露天过一宵。可是天上没有星。我想天要下雨了，又没有好天主阻挡下雨，我再回到城里\u201d。最终，好心的主教米里哀收留了他，称他\u201c我的兄弟\u201d，并把招待客人才用的银餐具拿出来，与他共进晚餐，留他住宿，让冉阿让19年来第一次睡上了床。当天夜里，冉阿让再次犯罪，偷走了主教用餐的银器，第二天早上被警察押回主教家里。结果主教说，\u201c呀!您来了!我真高兴再次见到您。我得提醒您，您把烛台忘记了，它和别的东西一样都是您的，您可以变卖200法郎。为什么您不把那对烛台和餐具一同带走?\u201d。主教 的谎言救了冉阿让。警察走后，主教对冉阿让说\u201c不要忘记，永远不要忘记您对我所做的允诺，您用这些银器是为了要做一个诚实的人。\u201d，\u201c冉阿让，我的兄弟，你已经不是恶人了，你是在善人一方的了。我赎的是你的灵魂，我把它从黑暗的思想和自暴自弃的精神里救出来，交还给上帝。\u201d主教抛弃法律，为了信仰和道德，做了伪证。宁愿自己承担教撒谎和不诚实的罪过，也要拯救冉阿让的灵魂，践行了信仰中的一个更高准则，牺牲自己拯救他人，我不入地狱，谁入地狱。主教感化了冉阿让，冉阿让决定重新做人，走上灵魂救赎之路。\n&nbsp;\n冉阿让改名换姓，化名马德兰来到偏远小城，凭借玻璃首饰工厂发财致富。马德兰一直没有忘记主教的期望，做一个正直善良的人。他的工厂招人条件只有一个：做诚实的男子。做诚实的姑娘。他自己一直过着朴素的生活，为穷人和慈善话费了上百万法郎，扩建医院，修建学校，建立贫儿院，设立老人和残疾人救济金，工厂开设免费药房。德高望重的马德兰做上了当地市长。为了救一个被压在马车下的农民，冒着暴露身份的危险和生命危险，钻到马车地下用背扛起马车。\n&nbsp;\n沙威是一个曾经见过冉阿让的警察，他一直怀疑马德兰就是冉阿让，并暗中调查，虽然目睹马德兰做了很多好事，但是一旦证实马德兰就是冉阿让，沙威就会毫不客气的将马德兰抓起来投进监狱。几年过去了，沙威一直没找到证据，直到他听说冉阿让已经入狱并经过亲自确认，沙威认为自己怀疑马德兰是冉阿让，作为底层军官，严重冒犯了马德兰，请求马德兰将他革职。沙威正直、直率、诚实、铁面无私、敬业，又毫无同情心、残忍，是统治者制定的社会秩序的坚决维护者，沙威的冷酷，很大程度上由于是现行制度的冷酷和法律的严峻。他认为一个人要是犯了罪，一辈子都是罪犯，不会改变。他的追求就是把他眼中的那些罪犯\u2014\u2014游民无赖，小偷，杀人犯，妓女之流全都送进监狱，送上断头台，永世不得翻身。对下层人民冷漠无情，觉得下层人民都是渣滓；对上层社会宽容，认为上层社会神圣不可冒犯。绅士调戏妓女芳汀，芳汀与绅士厮打在一起，沙威以冒犯绅士的罪名，无情的判芳汀入狱6个月，不顾芳汀入狱后孩子无人照顾，不惜与市长顶撞也要把芳汀送进监狱。而他奉命监视起义的大学生时，对掌握的大学生情况迟迟不报，有着精英思想，觉得大学生是上层社会的人，是社会栋梁。自从冉阿让从主教家里出来，沙威几十年如一日的追捕冉阿让，他一直对自己信奉的信条坚信不疑。最后，在监视起义者时，沙威被起义者发现并被捕，是冉阿让救了沙威的命，沙威开始对自己一辈子信奉的正义发生了动摇。当沙威再次抓到冉阿让时，沙威放了他。放了冉阿让，亵渎了法律，亵渎了自己一生的追求和信仰；但是沙威不承认冉阿让的品质高尚，做了很多好事，抓他又是卑鄙的。正义和法律不在一体，沙威手足无措，往日确信的事物在一一崩溃，头脑中的秩序乱套了，可遵循的教条消失了。沙威投河自尽了！沙威以死表明自己忠于自己的职守，当旧制度不能适应新社会，沙威作为旧制度的维护者，与旧社会一起消亡。\n&nbsp;\n马德兰从沙威口中得知\u201c冉阿让\u201d入狱之后，知道有人代己受过，经过一番思想挣扎，决定做一个诚实的人，投案自首，救出无辜的\u201c冉阿让\u201d。马德兰又成了冉阿让，被判终身苦役。后来冉阿让在一次做苦役的过程中，冒险救下一个船员，并故意掉入海中，乘机逃脱。从卑鄙的德纳第夫妇手中救出小女孩珂赛特，与小珂赛特相依为命，过上被沙威追捕的逃亡生活。两人建立父女感情，冉阿让视珂赛特比自己的生命更重要，珂赛特让冉阿让明白了爱。虽然冉阿让舍不得离开珂赛特，还是让珂赛特嫁给了革命青年马吕斯，并给他们夫妇留下自己所有的50万法郎的财产，而马吕斯对冉阿让的误会和珂赛特婚后对冉阿让的忽视，让冉阿让在痛苦中迅速老去，在冉阿让最后的几个小时，知道真相的马吕斯带着珂赛特来到冉阿让身边，马吕斯说，\u201c听到了吗，珂赛特?他说，我要原谅他!你知道他对我做了什么吗，珂赛特?他救过我的命。他把你给了我。在做完这些之后，在救了我的性命之后，在把你给我之后，珂赛特，他自己又怎么样呢?他牺牲了自己。他，就是这样的一个人。而我是个什么人?一个忘恩负义之徒!对我这样一个忘恩负义的人，这样一个残酷的人，这样一个罪人，他却说：\u2018谢谢!\u2019珂赛特，我终生为他鞠躬尽瘁也报答不尽他的恩情。街垒，阴沟，火坑，污水沟，他都闯过了。他为了谁?为了我，为了你，珂赛特!他背着我，让我远离死难，可他自己承受着一切。珂赛特，他是位天使!\u201d\n&nbsp;\n《悲惨世界》是一部关于爱、恩典与救赎的史诗，也是一部人类苦难的百科全书。雨果将人类的一切不幸统称为苦难。冉阿让的贫穷、牢狱与逃亡、珂赛特年幼受苦、芳汀被逼良为娼、通烟囱男孩的流浪、福舍勒旺老无所依、小嘉弗洛斯的饥寒交迫、忠于法律而跳河自尽沙威、沿着邪恶的道路走向毁灭的德纳第。这些有代表的人物，无论是他们物质还是精神的苦难，社会都有不可推卸的责任。雨果作为人类生存状况和命运的思考者，全方位地考察这些因果关系，以未来的名义去批判社会的历史和现状，以人类生存的名义去批判一切异已力量，从而表现了人类历史发展中的永恒性矛盾。正是在这个意义上，《悲惨世界》可以称作人类苦难的\u201c百科全书\u201d。\n&nbsp;\n购买地址","img":"http://apis.juhe.cn/goodbook/79cf86d4b95ff49df4a8be1410d44403,jpg","reading":"782人阅读","online":"京东:http://item.jd.com/10001613.html 当当:http://product.dangdang.com/22489516.html 亚马逊:http://www.amazon.cn/%E5%90%8D%E5%AE%B6%E5%90%8D%E8%AF%91%E2%80%A2%E6%82%B2%E6%83%A8%E4%B8%96%E7%95%8C-%E9%9B%A8%E6%9E%9C/dp/B005V6BWMI/ref=sr_1_1?ie=UTF8&amp;qid=1426339075&amp;sr=8-1&amp;keywords=%E6%82%B2%E6%83%A8%E4%B8%96%E7%95%8C","bytime":"2015年03月14日"}],"totalNum":"50","pn":0,"rn":"1"}
     * error_code : 0
     */

    public  String resultcode;
    public String reason;
    /**
     * data : [{"title":"悲惨世界","catalog":"外国文学 小说 经典名著 ","tags":"","sub1":"关于苦难的世界名著《悲惨世界》","sub2":"《悲惨世界》是法国著名作家雨果的经典名著，作为人类思想产生的一部伟大作品、文学巨著的一个丰碑，在世界文学宝库中占有无可争议的不朽地位。被评为世界十大名著，影响世界的100本书。\n&nbsp;\n名著之所以成为名著，在深度和广度上要有突出的表现。在广度上，描述了拿破仑战争期间和之后十几年的社会万象，融进了法国的历史、革命、战争、道德哲学、法律、正义、宗教信仰，作者对小说主要人物的原型、场景、社会现象进行了大量资料的收集和实地考察，雨果讲述每一个社会局部，都有着新闻记者似的准确，田野调查般的详实，作品几乎是一部拿破仑时代关于巴黎的百科全书。从构思到成书，历时30年，作者命运起起伏伏，社会也发生巨大改变，既为作者积累丰富的材料，也让作者目光变得更加深邃。在深度上，作者对人类苦难和人性有着触达灵魂的思考，《悲惨世界》被誉为人类苦难的百科全书。在人性的思考上，中国的文学和影视作品和欧美相差甚远，希望国人可以多读世界名著。\n&nbsp;\n金庸大师的《神雕侠侣》中，郭靖对杨过说，善与恶，都在一念之间。一念之差，杨康成了人人唾弃的卖国贼；一念之上，杨过成了神雕大侠。很多作品中，坏人总是极坏的，从里到外都是坏的；好人总是极好的，常因为好的过头而吃了坏人的大亏，让读者虐心。我们从小就被教育为非黑即白，事实上世界不是黑的也不是白的，而是灰的。没有人生下来就是坏人，一个人作恶，很多时候，社会负有很大的责任。《悲惨世界》主角冉阿让本是一个贫困的市民，老实本分的养家糊口，具有劳动人民吃苦耐劳的优良品质。直到社会让他失了业，和姐姐一家饿了肚子几天，为了救活7个外甥，跑到面包店偷了一个面包，被判入狱5年。出于对司法的不信任，冉阿让多次越狱被抓回，前后一共在牢中做苦役19年。19年的牢狱生活没有让冉阿让往好的一面改变，反而变得仇恨一切，不相信任何人，变成一个孤独而凶狠的男人。\n&nbsp;\n出狱后，冉阿让因为一张带有犯罪记录标识的身份证，被社会视作危险人物，天下之大，没有容身之地。\u201c我又走到另外一家客店。他们对我说：\u2018滚！\u2019这家不要我。那家也不要我。我又到了监狱，看门的人也不肯开门。我也到过狗窝。那狗咬了我，也把我撵了出来，好象它也是人似的，好象它也知道我是谁似的。我就跑到田里，打算露天过一宵。可是天上没有星。我想天要下雨了，又没有好天主阻挡下雨，我再回到城里\u201d。最终，好心的主教米里哀收留了他，称他\u201c我的兄弟\u201d，并把招待客人才用的银餐具拿出来，与他共进晚餐，留他住宿，让冉阿让19年来第一次睡上了床。当天夜里，冉阿让再次犯罪，偷走了主教用餐的银器，第二天早上被警察押回主教家里。结果主教说，\u201c呀!您来了!我真高兴再次见到您。我得提醒您，您把烛台忘记了，它和别的东西一样都是您的，您可以变卖200法郎。为什么您不把那对烛台和餐具一同带走?\u201d。主教 的谎言救了冉阿让。警察走后，主教对冉阿让说\u201c不要忘记，永远不要忘记您对我所做的允诺，您用这些银器是为了要做一个诚实的人。\u201d，\u201c冉阿让，我的兄弟，你已经不是恶人了，你是在善人一方的了。我赎的是你的灵魂，我把它从黑暗的思想和自暴自弃的精神里救出来，交还给上帝。\u201d主教抛弃法律，为了信仰和道德，做了伪证。宁愿自己承担教撒谎和不诚实的罪过，也要拯救冉阿让的灵魂，践行了信仰中的一个更高准则，牺牲自己拯救他人，我不入地狱，谁入地狱。主教感化了冉阿让，冉阿让决定重新做人，走上灵魂救赎之路。\n&nbsp;\n冉阿让改名换姓，化名马德兰来到偏远小城，凭借玻璃首饰工厂发财致富。马德兰一直没有忘记主教的期望，做一个正直善良的人。他的工厂招人条件只有一个：做诚实的男子。做诚实的姑娘。他自己一直过着朴素的生活，为穷人和慈善话费了上百万法郎，扩建医院，修建学校，建立贫儿院，设立老人和残疾人救济金，工厂开设免费药房。德高望重的马德兰做上了当地市长。为了救一个被压在马车下的农民，冒着暴露身份的危险和生命危险，钻到马车地下用背扛起马车。\n&nbsp;\n沙威是一个曾经见过冉阿让的警察，他一直怀疑马德兰就是冉阿让，并暗中调查，虽然目睹马德兰做了很多好事，但是一旦证实马德兰就是冉阿让，沙威就会毫不客气的将马德兰抓起来投进监狱。几年过去了，沙威一直没找到证据，直到他听说冉阿让已经入狱并经过亲自确认，沙威认为自己怀疑马德兰是冉阿让，作为底层军官，严重冒犯了马德兰，请求马德兰将他革职。沙威正直、直率、诚实、铁面无私、敬业，又毫无同情心、残忍，是统治者制定的社会秩序的坚决维护者，沙威的冷酷，很大程度上由于是现行制度的冷酷和法律的严峻。他认为一个人要是犯了罪，一辈子都是罪犯，不会改变。他的追求就是把他眼中的那些罪犯\u2014\u2014游民无赖，小偷，杀人犯，妓女之流全都送进监狱，送上断头台，永世不得翻身。对下层人民冷漠无情，觉得下层人民都是渣滓；对上层社会宽容，认为上层社会神圣不可冒犯。绅士调戏妓女芳汀，芳汀与绅士厮打在一起，沙威以冒犯绅士的罪名，无情的判芳汀入狱6个月，不顾芳汀入狱后孩子无人照顾，不惜与市长顶撞也要把芳汀送进监狱。而他奉命监视起义的大学生时，对掌握的大学生情况迟迟不报，有着精英思想，觉得大学生是上层社会的人，是社会栋梁。自从冉阿让从主教家里出来，沙威几十年如一日的追捕冉阿让，他一直对自己信奉的信条坚信不疑。最后，在监视起义者时，沙威被起义者发现并被捕，是冉阿让救了沙威的命，沙威开始对自己一辈子信奉的正义发生了动摇。当沙威再次抓到冉阿让时，沙威放了他。放了冉阿让，亵渎了法律，亵渎了自己一生的追求和信仰；但是沙威不承认冉阿让的品质高尚，做了很多好事，抓他又是卑鄙的。正义和法律不在一体，沙威手足无措，往日确信的事物在一一崩溃，头脑中的秩序乱套了，可遵循的教条消失了。沙威投河自尽了！沙威以死表明自己忠于自己的职守，当旧制度不能适应新社会，沙威作为旧制度的维护者，与旧社会一起消亡。\n&nbsp;\n马德兰从沙威口中得知\u201c冉阿让\u201d入狱之后，知道有人代己受过，经过一番思想挣扎，决定做一个诚实的人，投案自首，救出无辜的\u201c冉阿让\u201d。马德兰又成了冉阿让，被判终身苦役。后来冉阿让在一次做苦役的过程中，冒险救下一个船员，并故意掉入海中，乘机逃脱。从卑鄙的德纳第夫妇手中救出小女孩珂赛特，与小珂赛特相依为命，过上被沙威追捕的逃亡生活。两人建立父女感情，冉阿让视珂赛特比自己的生命更重要，珂赛特让冉阿让明白了爱。虽然冉阿让舍不得离开珂赛特，还是让珂赛特嫁给了革命青年马吕斯，并给他们夫妇留下自己所有的50万法郎的财产，而马吕斯对冉阿让的误会和珂赛特婚后对冉阿让的忽视，让冉阿让在痛苦中迅速老去，在冉阿让最后的几个小时，知道真相的马吕斯带着珂赛特来到冉阿让身边，马吕斯说，\u201c听到了吗，珂赛特?他说，我要原谅他!你知道他对我做了什么吗，珂赛特?他救过我的命。他把你给了我。在做完这些之后，在救了我的性命之后，在把你给我之后，珂赛特，他自己又怎么样呢?他牺牲了自己。他，就是这样的一个人。而我是个什么人?一个忘恩负义之徒!对我这样一个忘恩负义的人，这样一个残酷的人，这样一个罪人，他却说：\u2018谢谢!\u2019珂赛特，我终生为他鞠躬尽瘁也报答不尽他的恩情。街垒，阴沟，火坑，污水沟，他都闯过了。他为了谁?为了我，为了你，珂赛特!他背着我，让我远离死难，可他自己承受着一切。珂赛特，他是位天使!\u201d\n&nbsp;\n《悲惨世界》是一部关于爱、恩典与救赎的史诗，也是一部人类苦难的百科全书。雨果将人类的一切不幸统称为苦难。冉阿让的贫穷、牢狱与逃亡、珂赛特年幼受苦、芳汀被逼良为娼、通烟囱男孩的流浪、福舍勒旺老无所依、小嘉弗洛斯的饥寒交迫、忠于法律而跳河自尽沙威、沿着邪恶的道路走向毁灭的德纳第。这些有代表的人物，无论是他们物质还是精神的苦难，社会都有不可推卸的责任。雨果作为人类生存状况和命运的思考者，全方位地考察这些因果关系，以未来的名义去批判社会的历史和现状，以人类生存的名义去批判一切异已力量，从而表现了人类历史发展中的永恒性矛盾。正是在这个意义上，《悲惨世界》可以称作人类苦难的\u201c百科全书\u201d。\n&nbsp;\n购买地址","img":"http://apis.juhe.cn/goodbook/79cf86d4b95ff49df4a8be1410d44403,jpg","reading":"782人阅读","online":"京东:http://item.jd.com/10001613.html 当当:http://product.dangdang.com/22489516.html 亚马逊:http://www.amazon.cn/%E5%90%8D%E5%AE%B6%E5%90%8D%E8%AF%91%E2%80%A2%E6%82%B2%E6%83%A8%E4%B8%96%E7%95%8C-%E9%9B%A8%E6%9E%9C/dp/B005V6BWMI/ref=sr_1_1?ie=UTF8&amp;qid=1426339075&amp;sr=8-1&amp;keywords=%E6%82%B2%E6%83%A8%E4%B8%96%E7%95%8C","bytime":"2015年03月14日"}]
     * totalNum : 50
     * pn : 0
     * rn : 1
     */

    public ResultEntity result;
    public int error_code;


    public static class ResultEntity {
        public String totalNum;
        public int pn;
        public String rn;
        /**
         * title : 悲惨世界
         * catalog : 外国文学 小说 经典名著
         * tags :
         * sub1 : 关于苦难的世界名著《悲惨世界》
         * sub2 : 《悲惨世界》是法国著名作家雨果的经典名著，作为人类思想产生的一部伟大作品、文学巨著的一个丰碑，在世界文学宝库中占有无可争议的不朽地位。被评为世界十大名著，影响世界的100本书。
         &nbsp;
         名著之所以成为名著，在深度和广度上要有突出的表现。在广度上，描述了拿破仑战争期间和之后十几年的社会万象，融进了法国的历史、革命、战争、道德哲学、法律、正义、宗教信仰，作者对小说主要人物的原型、场景、社会现象进行了大量资料的收集和实地考察，雨果讲述每一个社会局部，都有着新闻记者似的准确，田野调查般的详实，作品几乎是一部拿破仑时代关于巴黎的百科全书。从构思到成书，历时30年，作者命运起起伏伏，社会也发生巨大改变，既为作者积累丰富的材料，也让作者目光变得更加深邃。在深度上，作者对人类苦难和人性有着触达灵魂的思考，《悲惨世界》被誉为人类苦难的百科全书。在人性的思考上，中国的文学和影视作品和欧美相差甚远，希望国人可以多读世界名著。
         &nbsp;
         金庸大师的《神雕侠侣》中，郭靖对杨过说，善与恶，都在一念之间。一念之差，杨康成了人人唾弃的卖国贼；一念之上，杨过成了神雕大侠。很多作品中，坏人总是极坏的，从里到外都是坏的；好人总是极好的，常因为好的过头而吃了坏人的大亏，让读者虐心。我们从小就被教育为非黑即白，事实上世界不是黑的也不是白的，而是灰的。没有人生下来就是坏人，一个人作恶，很多时候，社会负有很大的责任。《悲惨世界》主角冉阿让本是一个贫困的市民，老实本分的养家糊口，具有劳动人民吃苦耐劳的优良品质。直到社会让他失了业，和姐姐一家饿了肚子几天，为了救活7个外甥，跑到面包店偷了一个面包，被判入狱5年。出于对司法的不信任，冉阿让多次越狱被抓回，前后一共在牢中做苦役19年。19年的牢狱生活没有让冉阿让往好的一面改变，反而变得仇恨一切，不相信任何人，变成一个孤独而凶狠的男人。
         &nbsp;
         出狱后，冉阿让因为一张带有犯罪记录标识的身份证，被社会视作危险人物，天下之大，没有容身之地。“我又走到另外一家客店。他们对我说：‘滚！’这家不要我。那家也不要我。我又到了监狱，看门的人也不肯开门。我也到过狗窝。那狗咬了我，也把我撵了出来，好象它也是人似的，好象它也知道我是谁似的。我就跑到田里，打算露天过一宵。可是天上没有星。我想天要下雨了，又没有好天主阻挡下雨，我再回到城里”。最终，好心的主教米里哀收留了他，称他“我的兄弟”，并把招待客人才用的银餐具拿出来，与他共进晚餐，留他住宿，让冉阿让19年来第一次睡上了床。当天夜里，冉阿让再次犯罪，偷走了主教用餐的银器，第二天早上被警察押回主教家里。结果主教说，“呀!您来了!我真高兴再次见到您。我得提醒您，您把烛台忘记了，它和别的东西一样都是您的，您可以变卖200法郎。为什么您不把那对烛台和餐具一同带走?”。主教 的谎言救了冉阿让。警察走后，主教对冉阿让说“不要忘记，永远不要忘记您对我所做的允诺，您用这些银器是为了要做一个诚实的人。”，“冉阿让，我的兄弟，你已经不是恶人了，你是在善人一方的了。我赎的是你的灵魂，我把它从黑暗的思想和自暴自弃的精神里救出来，交还给上帝。”主教抛弃法律，为了信仰和道德，做了伪证。宁愿自己承担教撒谎和不诚实的罪过，也要拯救冉阿让的灵魂，践行了信仰中的一个更高准则，牺牲自己拯救他人，我不入地狱，谁入地狱。主教感化了冉阿让，冉阿让决定重新做人，走上灵魂救赎之路。
         &nbsp;
         冉阿让改名换姓，化名马德兰来到偏远小城，凭借玻璃首饰工厂发财致富。马德兰一直没有忘记主教的期望，做一个正直善良的人。他的工厂招人条件只有一个：做诚实的男子。做诚实的姑娘。他自己一直过着朴素的生活，为穷人和慈善话费了上百万法郎，扩建医院，修建学校，建立贫儿院，设立老人和残疾人救济金，工厂开设免费药房。德高望重的马德兰做上了当地市长。为了救一个被压在马车下的农民，冒着暴露身份的危险和生命危险，钻到马车地下用背扛起马车。
         &nbsp;
         沙威是一个曾经见过冉阿让的警察，他一直怀疑马德兰就是冉阿让，并暗中调查，虽然目睹马德兰做了很多好事，但是一旦证实马德兰就是冉阿让，沙威就会毫不客气的将马德兰抓起来投进监狱。几年过去了，沙威一直没找到证据，直到他听说冉阿让已经入狱并经过亲自确认，沙威认为自己怀疑马德兰是冉阿让，作为底层军官，严重冒犯了马德兰，请求马德兰将他革职。沙威正直、直率、诚实、铁面无私、敬业，又毫无同情心、残忍，是统治者制定的社会秩序的坚决维护者，沙威的冷酷，很大程度上由于是现行制度的冷酷和法律的严峻。他认为一个人要是犯了罪，一辈子都是罪犯，不会改变。他的追求就是把他眼中的那些罪犯——游民无赖，小偷，杀人犯，妓女之流全都送进监狱，送上断头台，永世不得翻身。对下层人民冷漠无情，觉得下层人民都是渣滓；对上层社会宽容，认为上层社会神圣不可冒犯。绅士调戏妓女芳汀，芳汀与绅士厮打在一起，沙威以冒犯绅士的罪名，无情的判芳汀入狱6个月，不顾芳汀入狱后孩子无人照顾，不惜与市长顶撞也要把芳汀送进监狱。而他奉命监视起义的大学生时，对掌握的大学生情况迟迟不报，有着精英思想，觉得大学生是上层社会的人，是社会栋梁。自从冉阿让从主教家里出来，沙威几十年如一日的追捕冉阿让，他一直对自己信奉的信条坚信不疑。最后，在监视起义者时，沙威被起义者发现并被捕，是冉阿让救了沙威的命，沙威开始对自己一辈子信奉的正义发生了动摇。当沙威再次抓到冉阿让时，沙威放了他。放了冉阿让，亵渎了法律，亵渎了自己一生的追求和信仰；但是沙威不承认冉阿让的品质高尚，做了很多好事，抓他又是卑鄙的。正义和法律不在一体，沙威手足无措，往日确信的事物在一一崩溃，头脑中的秩序乱套了，可遵循的教条消失了。沙威投河自尽了！沙威以死表明自己忠于自己的职守，当旧制度不能适应新社会，沙威作为旧制度的维护者，与旧社会一起消亡。
         &nbsp;
         马德兰从沙威口中得知“冉阿让”入狱之后，知道有人代己受过，经过一番思想挣扎，决定做一个诚实的人，投案自首，救出无辜的“冉阿让”。马德兰又成了冉阿让，被判终身苦役。后来冉阿让在一次做苦役的过程中，冒险救下一个船员，并故意掉入海中，乘机逃脱。从卑鄙的德纳第夫妇手中救出小女孩珂赛特，与小珂赛特相依为命，过上被沙威追捕的逃亡生活。两人建立父女感情，冉阿让视珂赛特比自己的生命更重要，珂赛特让冉阿让明白了爱。虽然冉阿让舍不得离开珂赛特，还是让珂赛特嫁给了革命青年马吕斯，并给他们夫妇留下自己所有的50万法郎的财产，而马吕斯对冉阿让的误会和珂赛特婚后对冉阿让的忽视，让冉阿让在痛苦中迅速老去，在冉阿让最后的几个小时，知道真相的马吕斯带着珂赛特来到冉阿让身边，马吕斯说，“听到了吗，珂赛特?他说，我要原谅他!你知道他对我做了什么吗，珂赛特?他救过我的命。他把你给了我。在做完这些之后，在救了我的性命之后，在把你给我之后，珂赛特，他自己又怎么样呢?他牺牲了自己。他，就是这样的一个人。而我是个什么人?一个忘恩负义之徒!对我这样一个忘恩负义的人，这样一个残酷的人，这样一个罪人，他却说：‘谢谢!’珂赛特，我终生为他鞠躬尽瘁也报答不尽他的恩情。街垒，阴沟，火坑，污水沟，他都闯过了。他为了谁?为了我，为了你，珂赛特!他背着我，让我远离死难，可他自己承受着一切。珂赛特，他是位天使!”
         &nbsp;
         《悲惨世界》是一部关于爱、恩典与救赎的史诗，也是一部人类苦难的百科全书。雨果将人类的一切不幸统称为苦难。冉阿让的贫穷、牢狱与逃亡、珂赛特年幼受苦、芳汀被逼良为娼、通烟囱男孩的流浪、福舍勒旺老无所依、小嘉弗洛斯的饥寒交迫、忠于法律而跳河自尽沙威、沿着邪恶的道路走向毁灭的德纳第。这些有代表的人物，无论是他们物质还是精神的苦难，社会都有不可推卸的责任。雨果作为人类生存状况和命运的思考者，全方位地考察这些因果关系，以未来的名义去批判社会的历史和现状，以人类生存的名义去批判一切异已力量，从而表现了人类历史发展中的永恒性矛盾。正是在这个意义上，《悲惨世界》可以称作人类苦难的“百科全书”。
         &nbsp;
         购买地址
         * img : http://apis.juhe.cn/goodbook/79cf86d4b95ff49df4a8be1410d44403.jpg
         * reading : 782人阅读
         * online : 京东:http://item.jd.com/10001613.html
         * 当当:http://product.dangdang.com/22489516.html
         * 亚马逊:http://www.amazon.cn/%E5%90%8D%E5%AE%B6%E5%90%8D%E8%AF%91%E2%80%A2%E6%82%B2%E6%83%A8%E4%B8%96%E7%95%8C-%E9%9B%A8%E6%9E%9C/dp/B005V6BWMI/ref=sr_1_1?ie=UTF8&amp;qid=1426339075&amp;sr=8-1&amp;keywords=%E6%82%B2%E6%83%A8%E4%B8%96%E7%95%8C
         * bytime : 2015年03月14日
         */

        public List<DataEntity> data;


        public static class DataEntity {
            public String title;
            public String catalog;
            public String tags;
            public String sub1;
            public String sub2;
            public String img;
            public String reading;
            public String online;
            public String bytime;

        }
    }
}
